<h1><center>Experiment 3</center></h1>
<h2><center>Connecting a local MySQL database to mysql-connector-python <h3><center>

In [12]:
import mysql.connector

In [13]:
import pandas as pd

In [14]:
dataBase = mysql.connector.connect( 
  host ="localhost", 
  user ="root", 
  passwd ="password",
  database = "College"
)

In [15]:
# preparing a cur object 
cur = dataBase.cursor()

In [16]:
query = """
    CREATE TABLE IF NOT EXISTS employee(
        id INT(10) PRIMARY KEY, 
        name TEXT NOT NULL,
        phone INT(10),
        email VARCHAR(50) NOT NULL UNIQUE
    )
"""
cur.execute(query)

In [17]:
pd.read_sql("desc employee",dataBase)

   Field         Type Null  Key Default Extra
0     id      int(10)   NO  PRI    None
1   name         text   NO         None
2  phone      int(10)  YES         None
3  email  varchar(50)   NO  UNI    None

In [18]:
query = """
    INSERT INTO employee (id, name, phone, email) VALUES
        (1, "Employee A", 983003372, "employee.a@organisation.org"),
        (2, "Employee B", 983003371, "employee.b@organisation.org"),
        (3, "Employee C", 983003373, "employee.c@organisation.org"),
        (4, "Employee D", 983003374, "employee.d@organisation.org"),
        (5, "Employee E", 983003375, "employee.e@organisation.org")
"""
cur.execute(query)

In [19]:
dataBase.commit()

In [20]:
pd.read_sql("SELECT * FROM employee",dataBase)

   id        name      phone                        email
0   1  Employee A  983003372  employee.a@organisation.org
1   2  Employee B  983003371  employee.b@organisation.org
2   3  Employee C  983003373  employee.c@organisation.org
3   4  Employee D  983003374  employee.d@organisation.org
4   5  Employee E  983003375  employee.e@organisation.org